#დაწერეთ პროგრამა, რომელიც მომხმარებელს შეეკითხება მართკუთხა სამკუთხედის კათეტების სიგრძეს(მთელი დადებითი რიცხვი) და გამოითვლის
#ამ სამკუთხედის ჰიპოთენუზის სიგრძეს და ფართობს.

a = int(input("შეიყვანეთ პირველი კათეტის სიგრძე: "))
b = int(input("შეიყვანეთ მეორე კათეტის სიგრძე: "))

c = (a**2 + b**2) ** 0.5
S = (a * b) / 2

print("ჰიპოთენუზა:", (c ))
print("ფართობი:", (S ))

#2. დაწერეთ პროგრამა, რომელიც მომხმარებელს შეეკითხება წამების რაოდენობას და გამოიტანეთ საათების, წუთების და წამების
#რაოდენობა (მაგ. 20000 წამი არის  5 საათი, 33 წუთი, 20 წამი)

A = int(input("შეიყვანეთ წამების რაოდენობა: "))
hours   = A // 3600

minutes = (A % 3600) // 60
seconds = A % 60

print(hours, "საათი,", minutes, "წუთი,", seconds, "წამი")